# Question 5

Step 1. Import the necessary libraries
Step 2. Import the dataset from this address.
Step 3. Assign it to a variable called chipo.
Step 4. See the first 10 entries
Step 5. What is the number of observations in the dataset?
Step 6. What is the number of columns in the dataset?
Step 7. Print the name of all the columns.
Step 8. How is the dataset indexed?
Step 9. Which was the most-ordered item?
Step 10. For the most-ordered item, how many items were ordered?
Step 11. What was the most ordered item in the choice_description column?
Step 12. How many items were orderd in total?
Step 13.
• Turn the item price into a float
• Check the item price type
• Create a lambda function and change the type of item price
• Check the item price type
Step 14. How much was the revenue for the period in the dataset?
Step 15. How many orders were made in the period?
Step 16. What is the average revenue amount per order?
Step 17. How many different items are sold?

**Step 1. Import the necessary libraries**

In [2]:
import pandas as pd
import numpy as np

**Step 2. Import the dataset from this address.**

In [3]:
pd.read_csv(r'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep = '\t')

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

**Step 3. Assign it to a variable called chipo.**

In [5]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', sep = '\t')
chipo.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

**Step 4. See the first 10 entries**

In [6]:
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

**Step 5. What is the number of observations in the dataset?**

In [7]:
chipo.shape[0]

4622

**Step 6. What is the number of columns in the dataset?**

In [8]:
chipo.shape[1]

5

**Step 7. Print the name of all the columns.**

In [9]:
list(chipo)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

**Step 8. How is the dataset indexed?**

In [14]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

**Step 9. Which was the most-ordered item?**

In [15]:
mostOrdered=chipo.groupby('item_name').sum()                    
mostOrdered = mostOrdered.sort_values(['quantity'], ascending=False) 
mostOrdered.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

**Step 10. For the most-ordered item, how many items were ordered?**

In [16]:
chipo.groupby('item_name')['quantity'].sum().max()

761

**Step 11. What was the most ordered item in the choice_description column?**

In [17]:
mostOrdered = chipo.groupby('choice_description').sum()
mostOrdered = mostOrdered.sort_values(['quantity'], ascending=False)
mostOrdered.head(1) #diet coke with 159

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

**Step 12. How many items were orderd in total?**

In [41]:
total_orders = chipo.quantity.sum()
total_orders

4972

**Step 13.
• Turn the item price into a float
• Check the item price type
• Create a lambda function and change the type of item price
• Check the item price type**

Step 13. A) Turn the item price into a float

In [42]:
chipo.item_price.dtype

dtype('float64')

In [34]:
func=lambda x: float(x)
chipo.item_price = chipo.item_price.apply(func)

In [35]:
chipo.item_price.dtype

dtype('float64')

**Step 14. How much was the revenue for the period in the dataset?**

In [36]:
revenue = (chipo['quantity']* chipo['item_price']).sum()
print('Revenue : $' + str(np.round(revenue,2)))

Revenue : $39237.02

**Step 15. How many orders were made in the period?**

In [37]:
chipo.order_id.value_counts().count()

1834

**Step 16. What is the average revenue amount per order?**

In [38]:
chipo['revenue'] = chipo['quantity'] * chipo['item_price']
chipo.groupby(by=['order_id']).sum().mean()['revenue']

21.394231188658654

**Step 17. How many different items are sold?**

In [39]:
chipo.item_name.value_counts().count()

50